package com.rumanweb.newsapp;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Context;
import android.content.Intent;
import android.graphics.Bitmap;
import android.graphics.drawable.BitmapDrawable;
import android.os.Build;
import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.view.Window;
import android.webkit.WebView;
import android.widget.BaseAdapter;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.ListView;
import android.widget.TextView;

import com.squareup.picasso.Picasso;

import java.util.ArrayList;
import java.util.HashMap;

public class MainActivity extends AppCompatActivity {

    ListView listView;
    ArrayList<HashMap<String, String>> arrayList = new ArrayList<>();
    HashMap<String, String> hashMap;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        listView = findViewById(R.id.list_item);

        CreateHashMap();

        MyAdapter myAdapter = new MyAdapter();
        listView.setAdapter(myAdapter);
    }

    public class MyAdapter extends BaseAdapter {

        @Override
        public int getCount() {
            return arrayList.size();
        }

        @Override
        public Object getItem(int position) {
            return null;
        }

        @Override
        public long getItemId(int position) {
            return 0;
        }

        @Override
        public View getView(int position, View convertView, ViewGroup viewGroup) {

            LayoutInflater layoutInflater = (LayoutInflater) getSystemService(Context.LAYOUT_INFLATER_SERVICE);
            View view = layoutInflater.inflate(R.layout.item_design, viewGroup, false);

            ImageView profileImage = view.findViewById(R.id.profileImage);
            TextView title = view.findViewById(R.id.title);
            TextView desc = view.findViewById(R.id.description);
            LinearLayout myLayout = view.findViewById(R.id.myLayout);

            HashMap<String, String> hashMap = arrayList.get(position);

            String image = hashMap.get("imageUrl");
            String titleText = hashMap.get("title");
            String newsDes = hashMap.get("newsDes");

            Picasso.get()
                    .load(image)
                    .into(profileImage);

            title.setText(titleText);
            desc.setText(newsDes);

            myLayout.setOnClickListener(new View.OnClickListener() {
                @Override
                public void onClick(View v) {

                    com.rumanweb.newsapp.WebView.TITLE = titleText;
                    com.rumanweb.newsapp.WebView.DESC = newsDes;

                    com.rumanweb.newsapp.WebView.MY_BITMAP = ((BitmapDrawable) profileImage.getDrawable()).getBitmap();

                    Intent myIntent = new Intent(MainActivity.this, com.rumanweb.newsapp.WebView.class);
                    startActivity(myIntent);
                }
            });


            return view;
        }
    }

    private void CreateHashMap() {

        hashMap = new HashMap<>();
        hashMap.put("imageUrl", "https://cdn.banglatribune.net/contents/cache/images/400x225x1/uploads/media/2024/01/03/eq-dfd2ed0b0ca78445c812a6a0153f645e.png");
        hashMap.put("title", "স্মার্ট ফোনে ভূমিকম্পের অ্যালার্ট চালু করবেন যেভাবে");
        hashMap.put("newsDes", "ভূমিকম্প এমন একটি প্রাকৃতিক দুর্যোগ যার পূর্বাভাস পাওয়ার তেমন কোনও প্রযুক্তি আমাদের হাতে এখনও নেই। এখন পর্যন্ত বিভিন্ন গবেষণা এবং পর্যবেক্ষণ থেকে কিছু পূর্বাভাস দেওয়ার চেষ্টা করা হয়। স্মার্টফোনে বিভিন্ন অ্যাপ রয়েছে যা ভূমিকম্পের মুহূর্তে বা কিছু আগে ব্যবহারকারীকে সতর্ক করার চেষ্টা করে। তবে অ্যাপ ছাড়াও অ্যান্ড্রয়েড ও আইফোনের নিজস্ব ফিচারও রয়েছে যা ব্যবহারকারীকে সতর্ক করে।\n" +
                "\n" +
                "অ্যান্ড্রয়েডে যেভাবে অ্যালার্ট চালু করতে হবে-\n" +
                "\n" +
                "১. এই ফিচারটি রয়েছে অ্যান্ড্রয়েড-৫ বা তার উপরের সংস্করণে\n" +
                "\n" +
                "২. ফিচারটি চালু থাকতে অবশ্যই সেলুলার বা ওয়াইফাই নেট চালু থাকতে হবে\n" +
                "\n" +
                "৩. এছাড়া ফোনের লোকেশান চালু রাখতে হবে\n" +
                "\n" +
                "৪. এগুলো চালুর পরে ফোনের সেটিংসে গিয়ে ‘Safety & Emergency’ অপশনে যেতে হবে। সরাসরি না পেলে সার্চ থেকে Safety লিখলেই চলে আসবে\n" +
                "\n" +
                "৫. সেখানে ‘Earthquake Alert’ অপশনটি চালু করে দিতে হবে\n" +
                "\n" +
                "৬. অপশনটির নিচে ‘Permission’ অপশন থাকতে পারে। সেখানে গিয়ে সব পারমিশন চালু করে দিতে হবে\n" +
                "\n" +
                " \n" +
                "\n" +
                "আইফোনে ভূমিকম্প অ্যালার্ট চালু করার নিয়ম-\n" +
                "\n" +
                "১. আবহাওয়া দফতরের তথ্যের ওপর ভিত্তি করে ভূমিকম্প অ্যালার্ট পাঠিয়ে থাকে অ্যাপল\n" +
                "\n" +
                "২. সেটি পাওয়ার জন্য আইফোনের সেটিংসে গিয়ে সেখানে নোটিফিকেশন অপশানে ট্যাপ করতে হবে\n" +
                "\n" +
                "৩. সেখানে ইমার্জেন্সি অ্যালার্ট চালু করে দিতে হবে। ইমার্জেন্সি অ্যালার্ট পাওয়া না গেলে গভর্মেন্ট অ্যালার্টের সবগুলো অপশন চালু করে দিতে হবে।\n" +
                "\n" +
                "এতে যেকোনও প্রাকৃতিক বিপর্যয় এলে ফোনে অ্যালার্ট আসবে। আইফোনেও লোকেশান চালু থাকতে হবে।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("imageUrl", "https://cdn.banglatribune.net/contents/cache/images/400x225x1/uploads/media/2020/04/01/171393c4f00be4bdcca3905d44ba251d-5e84545bdb0a7.jpg");
        hashMap.put("title", "ইউজার নেম দিয়ে ব্যবহারকারীকে খুঁজে বের করবে হোয়াটসঅ্যাপ\n");
        hashMap.put("newsDes", "হোয়াটসঅ্যাপের সার্চবারে ব্যবহারকারীর ইউজার নেম দিয়ে তাকে খুঁজে পাওয়া যাবে। সম্প্রতি ডাব্লিউএবেটাইনফোর দেওয়া একটি স্ক্রিনশটে এমনটিই দেখা গিয়েছে। অ্যাপটি দিয়ে যোগাযোগে নতুন এই আপডেটের মাধ্যমে ব্যক্তিগত নম্বর শেয়ার করার আর প্রয়োজন থাকবে না। রিপোর্টটিতে আরও জানানো হয় ইউজার নেম পছন্দ করার এই বিষয়টি থাকবে সম্পূর্ণ ঐচ্ছিক। আবার ব্যবহারকারী চাইলে যেকোনও সময় তার ইউজার নেম রিমুভ করে দিতে পারবে।\n" +
                "\n" +
                "রিপোর্টটিতে বলা হয়, এর মাধ্যমে ব্যবহারকারীরা একে অপরের নম্বর শেয়ার না করেও উভয়ের সঙ্গে যুক্ত হতে পারবে। যারা নিজেদের ব্যক্তিগত তথ্য শেয়ার করতে চায় না তাদের জন্য এই ফিচারটি হবে বেশ কার্যকর। ফিচারটি বর্তমানে ডেভেলপমেন্ট পর্যায়ে রয়েছে এবং পরবর্তী আপডেটে এটি পাওয়া যাবে বলে জনানো হয়েছে রিপোর্টটিতে।\n" +
                "\n" +
                "আবার হোয়াটসঅ্যাপ গোপন কোডের আরও একটি ফিচার এনেছে যার মাধ্যমে সংবেদনশীল চ্যাটকে নিরাপদ করা যাবে। এই কোডটির মাধ্যমে হোয়াটসঅ্যাপ আনলক করার কোড ছাড়াও অন্য আরও একটি কোড তৈরি করে তার গুরুত্বপূর্ণ চ্যটগুলোকে আলাদা করে লক করে রাখতে পারবে। মেটার সিইও মার্ক জাকারবার্গ তার হোয়াটসঅ্যাপ চ্যানেলে জানায়, চ্যাট লক করার জন্য সিক্রেট কোড ব্যবস্থা চালু করা হয়েছে হোয়াটসঅ্যপে। এর মাধ্যমে ব্যবহারকারী একটি ইউনিক পাসওয়ার্ড দিয়ে তার চ্যাটকে নিরাপদ করতে পারবে। এই সিক্রেট কোডটি সার্চ বারে টাইপ করলেই শুধুমাত্র সেই চ্যাটটি ওপেন হবে। সুতরাং আরেকজন চাইলেও তার প্রাইভেট চ্যাটের বিষয়ে কিছুই জানতে পারবে না।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("imageUrl", "https://cdn.banglatribune.net/contents/cache/images/900x505x1/uploads/media/2023/10/13/Google-AI-9ad14c4a9493fb8cdda3991979bfaeec.jpg");
        hashMap.put("title", "গুগলের সার্চবারে সরাসরি জেনারেট করা যাবে এআই ছবি\n");
        hashMap.put("newsDes", "এত দিন এআই (আর্টিফিসিয়াল ইন্টেলিজেন্স) ছবি তৈরি করার জন্য আমাদের বিশেষ কোনও সাইটে গিয়ে কমান্ড দিয়ে জেনারেট করতে হতো। সম্প্রতি গুগল ঘোষণা দিয়েছে, তাদের সার্চ জেনারেটেড এক্সপেরিয়েন্স বা এসজিইর মাধ্যমে স্ট্যান্ডার্ড সার্চবার থেকেই ছবি জেনারেট করা যাবে।\n" +
                "\n" +
                "সংবাদমাধ্যম এনগেজেট জানায়, এসজিই হলো ভবিষ্যৎ সার্চিংয়ে এটি গুগলের ভিশন। এখানে ওয়েব লিংকের তালিকা দেওয়ার বদলে ব্যবহারকারীর ভাষা অনুযায়ী ঠিক লিংকের বদলে সংগত উত্তর দিয়ে দেবে।\n" +
                "\n" +
                "সম্প্রতি এই অভিজ্ঞতারই একটি অগ্রগতি হয়েছে। এখানে জেনারেটেড টেক্সটের বদলে জেনারেটেড ইমেজ দেওয়া হচ্ছে শুধু। ব্যবহারকারী কোনও ছবির কমান্ড দিলে গুগল চারটি ছবি জেনারেট করে দেখাচ্ছে। ব্যবহারকারী তার পছন্দমতো ছবি তার ড্রাইভে বা ডিভাইসে ডাউনলোড করে নিতে পারবে।\n" +
                "\n" +
                "তবে এই ফিচারের কিছু সীমাবদ্ধতাও রয়েছে। ব্যবহারকারীকে গুগল ল্যাবে সাইনআপ করতে হবে এবং এসজিই বেছে নিতে হবে। আপাতত নতুন এই ফিচারটি শুধু যুক্তরাষ্ট্রে ইংরেজি ভাষায় এবং ১৮ বছরের ওপরের ব্যবহারকারীদের জন্য উন্মুক্ত করা হয়েছে। এ ছাড়া অপব্যবহার ঠেকাতে মানুষের মুখের বাস্তব ধরনের অর্থাৎ ফটোরিয়েলিস্টিক ছবি তৈরি করা যাবে না এখান থেকে।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("imageUrl", "https://cdn.banglatribune.net/contents/cache/images/900x505x1/uploads/media/2023/10/13/Google-AI-9ad14c4a9493fb8cdda3991979bfaeec.jpg");
        hashMap.put("title", "Google Maps : বদলে যাচ্ছে গুগল ম্যাপ! বাঁচবে গাড়ির তেলের খরচ, মিলবে ট্রেনের লাইভ লোকেশন");
        hashMap.put("newsDes", "আঞ্চলিক পর্যায়ে একগুচ্ছ সুবিধা যোগ করতে চলেছে গুগল। ব্যবহারকারীদের সুবিধার্থে নিত্য দিনে কাজে কাজে লাগে এমন সুবিধা পাওয়া যাবে এই অ্যাপে। যারা নিয়মিত ট্রেনে যাতায়াত করেন তারা পাবেন ট্রেনের লাইভ লোকেশন। এছাড়াও গাড়ি চালকদের জন্য তেল খরচ বাঁচানোর ফিচার দেবে গুগল।\n" +
                "\n" +
                "গন্তব্যে পৌঁছনোর জন্য গুগল ম্যাপসের ভরসা করেন সবাই। এবার থেকে অ্যাপে বেশ কিছু নতুন বৈশিষ্ট্য দেখতে পাবেন। সবচেয়ে বড় পরিবর্তন ম্যাপে আঞ্চলিক সীমানা যোগ করা। এতদিন পশ্চিমা দেশগুলির স্ট্রিট ভিউয়ের মতো দেখাত গুগল ম্যাপস।\n" +
                "\n" +
                "2024 সালে সমস্ত অ্যান্ড্রয়েড ব্যবহারকারীদের স্মার্টফোন এই সুবিধাগুলি পাওয়া যাবে বলে জানিয়েছে গুগল। সাধারণত রাস্তা চেনার ক্ষেত্রে ভারতীয়রা ছোট ছোট ল্যান্ডমার্ক চিনে রাখে। যেমন কোনও দোকান, পার্ক ইত্যাদি। ভারতীয়দের এই অভ্যাসকে উপলব্ধি করেছে সার্চ ইঞ্জিন। সেই মতোই সাজানো হয়েছে নতুন সুবিধাগুলি।\n" +
                "\n" +
                "অ্যাড্রেস ডেসক্রিপশন\n" +
                "\n" +
                "কাউকে ঠিকানা চিনিয়ে দেওয়ার জন্য অনেকেই ছোট ছোট ল্যান্ডমার্কের সাহায্য নেন। গুগলও এবার থেকে তাই করবে। মেশিন লার্নিং প্রযুক্তির সাহায্যে কাজ করবে এই ফিচার। ম্যাপে যে ঠিকানা দেবেন তার নিকটবর্তী 5টি ল্যান্ডমার্ক, এরিয়ার নাম তুলে ধরবে গুগল। যা থেকে ব্যবহারকারীর বুঝতে সুবিধা হবে ওই ঠিকানাটা আসলে কোন জায়গায়।\n" +
                "\n" +
                "কৃত্রিম বুদ্ধিমত্তার সাহায্যে গোটা প্রক্রিয়াটি কাজ করবে। এই ল্যান্ডমার্ক আপনি শেয়ারও করতে পারবেন। আগামী বছর জানুয়ারি থেকে সমস্ত ব্যবহারকারীদের ফোনে রোল আউট হতে চলেছে এই সুবিধা।\n" + "\nফুয়েল সেভিং\n" +
                "\n" +
                "জ্বালানি বাঁচাতে চান? গুগলের নতুন ফিচার শুনলে খুশি হিতে পারেন। কোন রাস্তা দিয়ে গেলে দ্রুত পৌঁছতে পারবেন। গাড়ির ইঞ্জিন অনুযায়ী নির্দিষ্ট রুটে কত জ্বালানি দক্ষতা পাওয়া যায় ইত্যাদি তথ্য জানতে পারবেন। এখানেও কৃত্রিম বুদ্ধিমত্তার মাধ্যমে লাইভ ট্রাফিক আপডেট এবং রুটের তথ্য জানাবে গুগল।\n" +
                "\n" +
                "ট্রেনের লাইভ লোকেশন ও লাইভ ওয়াকিং\n" +
                "\n" +
                "গুগলের Where is My Train-এ নতুন ফিচার যোগ হয়েছে। 2024 সাল থেকে কলকাতা ও মুম্বই লোকাল ট্রেনের লাইভ লোকেশন পেয়ে যাবেন এখানেই। পাশাপাশি লাইভ ওয়াক অ্যাসিস্ট্যান্সও যোগ হচ্ছে। অর্থাৎ পা ফেলা মাত্রই নেভিগেশন কাজ করা শুরু করবে।\n" +
                "\n" +
                "হাঁটতে শুরু করলে ফোনের ডিসপ্লেতে অ্যারো দেখতে পাবেন যা বলে দেবে কোন দিকে যেতে হবে। ঘুরলেই ভাইব্রেট হবে ফোন। এই ফিচারের অধীনে 3000 সাইটস যোগ করেছে গুগল।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("imageUrl", "https://cdn.banglatribune.net/contents/cache/images/900x505x1/uploads/media/2019/10/20/4e621bf369af1380d0ae8b1b791e4925-5dac84f861647.jpg");
        hashMap.put("title", "থ্রিজি সেবা বন্ধ করছে গ্রামীণফোন\n");
        hashMap.put("newsDes", "মোবাইল ফোন অপারেটর গ্রামীণফোন থ্রি-জি সেবা বন্ধের উদ্যোগ নিয়েছে। গ্রামীণফোনের আবেদনের পর এরইমধ্যে বাংলাদেশ টেলিযোগাযোগ নিয়ন্ত্রক সংস্থা (বিটিআরসি) অনুমোদনও দিয়েছে অপারেটরটিকে। বিটিআরসির সর্বোচ্চ ফোরাম কমিশন বৈঠকে (২৭৫তম) গ্রামীণফোনকে এই পদক্ষেপ নেওয়ার অনুমোদন দেওয়া হয়েছে।\n" +
                "\n" +
                "অপারেটরটি জানিয়েছে, থ্রি-জি সেবা বন্ধ (স্থগিত) করতে ৬ হাজার ৪২৯টি সাইট (টাওয়ার) বন্ধ বা স্থগিত করতে হবে।\n" +
                "\n" +
                "গ্রামীণফোনের থ্রি-জি সাইটের (মোবাইল টাওয়ার) সংখ্যা ৬ হাজার ৪২৯টি। এরমধ্যে চট্টগ্রাম বিভাগে রয়েছে ২ হাজার ৬০১টি, খুলনা বিভাগে ১ হাজার ৬১২টি, রাজশাহী বিভাগে ৮৩৩টি, ময়মনসিংহ বিভাগে ৬৮০টি, ঢাকা বিভাগে ৫৫০টি এবং বরিশাল বিভাগে রয়েছে ১৫৩টি সাইট।    \n" +
                "\n" +
                "জানা গেছে, বিটিআরসি গ্রামীণফোনকে থ্রি-জি সেবা স্থগিত করতে ৫টি শর্ত দিয়ে তা প্রতিপালন করার নির্দেশনা জারি করেছে। এছাড়া নিয়ন্ত্রক সংস্থাটির স্পেক্ট্রাম বিভাগ থেকে ২টি শর্ত দিয়ে নির্দেশনা জারি করা হয়েছে। শর্তযুক্ত নির্দেশনাগুলো মেনে থ্রি-জি সেবা বন্ধের জন্য কাজ শুরু করেছে গ্রামীণফোন।\n\n"+"\n২০২১ সালের অক্টোবর মাসে ডাক ও টেলিযোগাযোগমন্ত্রী মোস্তাফা জব্বারের কাছে থ্রি-জি নিয়ে জানতে চাইলে তিনি বলেছিলেন, আমরা থ্রি-জি আর রাখার প্রয়োজনীয়তা দেখছি না। আমরা চাই লোকজন ফোর-জি ব্যবহার করুক। কারণ, হিসেবে তিনি উল্লেখ করেন, আগামীতে টু-জি ও ফোর-জিই থাকবে।\n" +
                "\n" +
                "সংশ্লিষ্ট সূত্র জানায়, থ্রি-জি সেবা স্থগিতের আবেদনে গ্রামীণফোন জানিয়েছে, বিভিন্ন বিভাগের ৩৫টি জেলায় ৬ হাজার ৪২৯টি সাইটে চলতি মাসের (সেপ্টেম্বর) মধ্যে থ্রি-জি টেলিযোগাযোগ সেবা স্থগিত করার পরিকল্পনা করেছে। এরইমধ্যে ওই সাইটগুলোর গ্রাহকরা টু-জি ও ফোর-জি সেবার আওতাধীন রয়েছেন। এতে এসব এলাকার গ্রাহকরা নিরবছিন্ন ও আধুনিক সেবা পাবেন।\n" +
                "\n" +
                "বিটিআরসি গ্রামীণফোনকে যেসব শর্ত দিয়েছে তা হলো—থ্রি-জি সেবা বন্ধ করা হলে গ্রাহককে ইন্টারনেট সেবা ব্যবহারের জন্য ফোর-জি নেটওয়ার্ক ও টু-জি নেটওয়ার্ক নিশ্চিত করতে হবে।\n" +
                "\n" +
                "সংশ্লিষ্ট এলাকায় থ্রি-জি সেবা স্থগিত করতে হলে থ্রি-জি সিম বদলে ফোর-জি সিম সংগ্রহের জন্য প্রয়োজনীয় রিটেইলারের ব্যবস্থা রাখতে হবে। আর যারা ফোর-জি সেবা নিতে ইচ্ছুক নয় তারা যেন টু-জি নেটওয়ার্কের মাধ্যমে ইন্টারনেট সেবা পেতে পারে সে ক্ষেত্রে অপারেটরকে সমতুল্য মূল্যে প্রয়োজনীয় ইন্টারনেটের ব্যবস্থা করতে হবে। এছাড়া যেসব এলাকায় থ্রি-জি সেবা স্থগিত করা হবে সেসব এলাকায় গ্রাহকদের বিভিন্ন প্রচারমাধ্যম তথা এসএমএস, ভয়েস মেসেজ, রেডিও, টেলিভিশন, অনলাইন, গ্রাহক সেবা কেন্দ্রের মাধ্যমে জানাতে হবে।\n\n"+"থ্রি-জি সেলুলার মোবাইল নেটওয়ার্ক সেবা প্রদানের লাইসেন্স মোতাবেক থ্রি-জি সেবা প্রদান বন্ধের ৯০ দিন আগে কমিশন ও সংশ্লিষ্ট গ্রাহকদের জানানোর নিয়ম রয়েছে।\n" +
                "\n" +
                "জানতে চাইলে গ্রামীণফোনের মুখপাত্র হোসেন সাদাত বলেন, গ্রামীণফোন বিটিআরসি প্রদত্ত সব নির্দেশনা মেনে দায়িত্বশীলতার সঙ্গে ব্যবসায়িক কার্যক্রম পরিচালনা করে। বিটিআরসির অনুমোদন মোতাবেক আমরা প্রয়োজনীয় পদক্ষেপ নেওয়া শুরু করেছি।\n" +
                "\n" +
                "প্রসঙ্গত, মোবাইল ফোন অপারেটর রবি সবার আগে থ্রি-জি বন্ধের অনুমোদন চেয়ে আবেদন করে বিটিআরসিতে। রবি অনুমোদন পেয়ে থ্রি-জি বন্ধের প্রক্রিয়া শুরু করেছে। জানা গেছে, বাংলালিংকও থ্রি-জি সেবা বন্ধের জন্য বিটিআরসিতে আবেদন করে অনুমোদন পেয়েছে। গ্রামীণফোনকে যেসব শর্ত দেওয়া হয়েছে, একই শর্ত বাংলালিংককেও দেওয়া হয়েছে। বাংলালিংক থ্রি-জি সেবার সাইট (টাওয়ার) বন্ধ করলে প্রযোজ্য শর্ত মেনেই করতে হবে।\n");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("imageUrl", "https://cdn.banglatribune.net/contents/cache/images/900x505x1/uploads/media/2023/12/11/qr-03ea32e53bfb32dce5e94c79dc97d8be.jpg");
        hashMap.put("title", "ভুয়া কিউআর কোডের মাধ্যমের তথ্য হাতিয়ে নিচ্ছে স্প্যামাররা");
        hashMap.put("newsDes", "ভুয়া কিউআর কোডের মাধ্যমে ব্যবহারকারীর তথ্য হাতিয়ে নিচ্ছে স্প্যামাররা। সম্প্রতি যেকোনও কিউআর কোড স্ক্যান করার ব্যাপারে সতর্ক করেছে ফেডারেল ট্রেড কমিশন। কনজুমার অ্যালার্টের একটি ব্লগে তারা এই তথ্য জানায়। স্প্যমাররা এই কিউআর কোডের মাধ্যমে ব্যবহারকারীদের অনাকাঙ্ক্ষিত স্থানে নিয়ে যেতে পারে। এরপর বিভিন্ন মূল্য পরিশোধ, লগইন বা অন্যান্য সংবেদনশীল তথ্যের জন্য অপেক্ষা করতে থাকে।\n" +
                "\n" +
                "নিউইয়র্ক টাইমসের সূত্রে ট্রেলিক্স নামে একটি সাইবার সিকিউরিটি প্রতিষ্ঠানের থ্রেট ইনটেলিজেন্সের প্রধান জন ফোক্কার জানায়, এ বছরের তৃতীয় প্রান্তিকে তাদের প্রতিষ্ঠান এমন কিউআর কোড আক্রমণের ৬০ হাজার স্যাম্পল পেয়েছে। এমন ভুয়া কোডের শিকার হওয়া থেকে রক্ষা পেতে এফটিসি’র পরামর্শ হলো, অনাকাঙ্ক্ষিত ই-মেইল এবং মেসেজ উপেক্ষা করতে। অনাকাঙ্ক্ষিত কোনও স্থান থেকে এমন জরুরি কোনও অনুরোধ এলে সে ব্যাপারে সতর্ক থাকতে হবে। কোনও স্ক্যানিংয়ের পরে পেমেন্টের অপশন এলে ইউআরএলটা ভালোভাবে চেক করে নিতে হবে সেটা বিশ্বস্ত কি না। বিশেষ করে ব্যবহারকারী কোনও সাইটে প্রবেশ করতে চাইলে সরাসরি সেটা লিখে ভিজিট করলেই ভালো।\n" +
                "\n" +
                "কমিশন আরও বলেছে ডিভাইস সবসময় আপডেট রাখা এবং সংবেদনশীল অ্যাকাউন্টগুলোতে শক্তিশালী পাসওয়ার্ড এবং মাল্টি-ফ্যাক্টর অথেনটিকেশন চালু রাখতে। এফটিসি’র পরামর্শ ছাড়াও আরও কিছু বিষয় মেনে চলতে বলেছে সংবাদ মাধ্যম ভার্জ। কিউআর কোড স্ক্যানিংয়ের কোনও অ্যাপ ডাউনলোড না করে অ্যান্ড্রয়েড এবং আইওএসের বিল্টইন ক্যামেরা ব্যবহার করা। এমন অ্যাপ অনেক সময় তথ্য চুরি করার জন্যই বানানো হয় বলে মন্তব্য করে সংবাদমাধ্যমটি।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("imageUrl", "https://cdn.banglatribune.net/contents/cache/images/900x505x1/uploads/media/2023/12/11/-83ec2ed9a7431a5a40eaab171b8d245f.jpg");
        hashMap.put("title", "আসছে বাংলা ভার্চুয়াল অ্যাসিস্ট্যান্ট ‘সাথী’");
        hashMap.put("newsDes", "মধ্যরাতে হঠাৎ কেউ অসুস্থ হয়ে পড়লো। পরিবারের লোকজন বুঝতে পারছেন না রোগীকে কোথায় নেবেন, কাকে ফোন দেবেন, এত রাতে কেউ ফোন ধরবে কিনা। তবে এ ধরনের বিপদে মোবাইলের একটি অ্যাপ অন করে সমস্যাটি বলুন। অ্যাপটি আপনাকে রোগীর রোগ সংশ্লিষ্ট হাসপাতালের সঙ্গে সংযুক্ত করে দেবে। শুধু তাই নয় এই অ্যাপে যদি কেউ শিক্ষা বিষয়ক, থানার তথ্য কিংবা কোনও অফিসের ঠিকানা বা লোকেশন জানতে চান; তখনই তাকে অ্যাপটি সেসব তথ্য জানিয়ে দেবে। মূলত অ্যাপলের সিরি বা অ্যামাজনের অ্যালেক্সার মতোই একটি ভার্চুয়াল অ্যাসিস্ট্যান্ট অ্যাপ চালু করতে যাচ্ছে সরকার, যার নাম দেওয়া হয়েছে ‘সাথী’।\n" +
                "\n" +
                "দ্বাদশ জাতীয় সংসদ নির্বাচনের আগেই এটি চালু করতে সব ধরনের প্রস্তুতিও নেওয়া হয়েছে। এটিকে একটি নির্বাচনি উপহারও বলা হচ্ছে। অ্যাসপায়ার টু ইনোভেট (এটুআই) এই অ্যাপ নিয়ে কাজ করছে। টেলিযোগাযোগ নিয়ন্ত্রক সংস্থা বিটিআরসি এই খাতে ফান্ড দেবে। আগামী ১২ থেকে ১৫ ডিসেম্বরের মধ্যে এটির উদ্বোধন করা হবে বলে জানা গেছে। সংশ্লিষ্ট সূত্র জানিয়েছে, আগামী ১২ ডিসেম্বর হলো ‘স্মার্ট বাংলাদেশ দিবস’,  ওইদিনই ‘সাথী’ উদ্বোধন হতে পারে।\n" +
                "\n" +
                "এ বিষয়ে জানতে চাইলে ডাক, টেলিযোগাযোগ এবং তথ্য ও যোগাযোগ প্রযুক্তি বিভাগের প্রতিমন্ত্রী জুনাইদ আহমেদ পলক বাংলা ট্রিবিউনকে ‘সাথী’ চালুর ব্যাপারে নিশ্চিত করেছেন। তিনি জানিয়েছেন, ‘এটা হবে স্মার্ট নাগরিকের জন্য স্মার্ট সংযোগ। এটা এমন একটা সংযোগ ব্যবস্থা, যা হবে মানুষের সাথী বা পার্টনার। তার কাছ থেকে ব্যবহারকারী সব ধরনের তথ্য পাবে।’\n" +
                "\n" +
                "জানা যায়, ডাক ও টেলিযোগাযোগ বিভাগের দায়িত্ব পাওয়ার পরে প্রতিমন্ত্রী জুনাইদ আহমেদ পলক গত ৬ ডিসেম্বর প্রথমবারের মতো টেলিযোগাযোগ নিয়ন্ত্রক সংস্থা বিটিআরসি পরিদর্শনে যান। সেখানে বিটিআরসি চেয়ারম্যান, কমিশনার, মহাপরিচালক ও পরিচালকদের সঙ্গে মতবিনিময় করেন। সেই মতবিনিময় বৈঠকে জুনাইদ আহমেদ পলক এমন একটা উদ্যোগে বিটিআরসিকে শামিল হওয়ার আহ্বান জানান। পলকের সেই আহ্বানে সাড়া দিয়ে বিটিআরসি কর্তৃপক্ষ এটুআই উদ্ভাবিত এই প্রযুক্তির (সাথী) পাশে থাকার প্রতিশ্রুতি ব্যক্ত করে। \n" +
                "\n" +
                "বৈঠকের একটি সূত্র জানায়, সাথী’র উদ্ভাবন, উন্নয়ন, প্রচার-প্রসারের ব্যয়ভার বিটিআরসি বহন করবে বলে জানানো হয়। সূত্রটি আরও জানায়, প্রতিমন্ত্রী পলক বৈঠকে বলেছেন—এই প্রযুক্তি নির্বাচনের আগে দেশবাসীর জন্য বিশেষ উপহার। সরকারের সব ধরনের ডিজিটাল সার্ভিস, পেমেন্ট গেটওয়ে ইত্যাদি এতে সংযুক্ত থাকবে। ফলে গ্রাহক আগের চেয়ে মোবাইল ব্যবহার করে বেশি বেশি কাজ সহজে করতে পারবেন। তাদের জীবনযাত্রা আরও সহজ হবে।\n" +
                "\n" +
                "সংশ্লিষ্ট সূত্রে জানা গেছে, এরইমধ্যে সাথী’র একটি প্রাথমিক ইন্টারফেস তৈরি হয়েছে। সাথী কেমন হবে, কীভাবে কাজ করবে—এসব বিষয়সহ যাবতীয় কার্যক্রম আগেই ঠিক করা রয়েছে। সাথী মোবাইল সিমের সঙ্গে ‘একীভূত’ করা থাকবে। মোবাইলে সিম চালু থাকলেই এটি সেটে সক্রিয় হবে না। মোবাইলে ইনস্টল করে নিতে হবে। তবে এটি ডাউনলোড করতে যাতে ব্যবহারকারীর কোনও ধরনের ডেটা (ইন্টারনেট) খরচ না হয় সেই ব্যবস্থাও থাকবে। সাথী যাতে মোবাইলে কোনও জায়গা না নেয় সেটা নিয়েও ভাবা হচ্ছে। স্মার্ট ও ফিচার ফোন- দুই ফোনেই সাথী ব্যবহার করা যাবে। সাথীকে অ্যাপ স্টোর বা প্লে-স্টোর থেকে ডাউনলোড করে নিতে হবে।\n" +
                "\n" +
                "যেসব মোবাইল ব্যবহারকারী ইউএসএসডি বা অন্যান্য ফিচার ব্যবহার করতে স্বাচ্ছন্দ্য বোধ করেন না, সাথীকে মুখে বললেই কানেক্ট করিয়ে দেবে সেসব সেবায়। কলসেন্টার প্রতিনিধির সঙ্গে কথা বলতে চাইলেও কথা বলিয়ে দেওয়ার ব্যবস্থা করবে সাথী। ধীরে বেসরকারি মোবাইল ফোন অপারেটর ও বিভিন্ন সেবা কেন্দ্রের সেবাকেও সাথী সংযোগ করিয়ে দেবে। সংশ্লিষ্টরা বলছেন, এতে মোবাইলে ফোনে অ্যাপের ব্যবহার কমবে।  সাথীর বিভিন্ন ফিচার পর্যায়ক্রমে গ্রাহকের কাছে উন্মুক্ত করা হবে। সাথী ইনস্টল করা থাকলে প্রতিটি ফিচার উন্মুক্ত হওয়ার সঙ্গে সঙ্গে প্লে-স্টোর ও অ্যাপ স্টোরে স্বয়ংক্রিয়ভাবে আপডেট হবে। সাথী একটি জিপিটি এনাবল্ড এআই অ্যাসিস্ট্যান্ট হিসেবে ব্যবহারকারীদের সেবা দিতে আরও স্মার্ট হতে থাকবে। গ্রাহকের সুবিধার্থে ভবিষ্যতে সাথীর সঙ্গে চ্যাটবট যুক্ত করার পরিকল্পনা রয়েছে বলে জানা গেছে। ");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("imageUrl", "https://cdn.banglatribune.net/contents/cache/images/400x225x1/uploads/media/2024/01/01/New-technology-trends-that-will-change-the-way-we-live-in-2024-fd7db1c0420169e4aac12e1f471bafb1.jpg");
        hashMap.put("title", "২০২৪ সাল কাঁপাবে যেসব প্রযুক্তি\n");
        hashMap.put("newsDes", "প্রযুক্তি অত্যন্ত দ্রুতগতির বিবর্তনশীল এবং বিকাশমান একটি জগৎ। প্রতিনিয়তই আসছে নতুন নতুন প্রযুক্তি। পাশাপাশি বিদ্যমান প্রযুক্তিগুলোরও নতুন প্রয়োগ ক্ষেত্র তৈরি হওয়ায় সেগুলোরও ব্যবহার বাড়ছে প্রতিনিয়ত। এরমধ্যে কিছু প্রযুক্তি রয়েছে যেগুলোকে বলা যেতে পারে ২০২৪ সালকে প্রতিনিধিত্ব করবে। এমন কয়েকটি প্রযুক্তি সম্পর্কে আলোচনা করা হলো।\n" +
                "\n" +
                "১. জেনারেটিভ এআই\n" +
                "\n" +
                "২০২২ সালের শেষের দিক থেকে যাত্রা শুরু হয় কৃত্রিম বুদ্ধিমত্তার (এআই)। শুরুর পর থেকেই বলা যেতে পারে এটি প্রযুক্তির জগতে বেশ বড় একটি প্রভাব বিস্তার করেছে। এ বছরও এটি একটি নেতৃস্থানীয় জায়গা দখল করবে। বড় বড় ল্যাঙ্গুয়েজ মডেলের পাশাপাশি অল্প খরচের ছোট ল্যাঙ্গুয়েজ মডেলও তৈরি হবে। তথ্য এবং জেনারেটিভ এআই মডেলের সংমিশ্রণে তৈরি হবে একটি অপ্রতিরোধ্য প্ল্যাটফর্ম। বিভিন্ন ব্যবসায়িক প্রতিষ্ঠানে শুরু হবে এর ব্যাপক ব্যবহার। প্রতিষ্ঠানগুলোতে অভিজ্ঞ টেকনিক্যাল এক্সপার্ট ছাড়াই এটি কাজ করবে। সুদূর ভবিষ্যতে এটি ইন্টারকানেক্টেড নেটওয়ার্ক মডেল ডিজাইনে নেতৃত্ব দেবে এবং প্রতিটি কাজের জন্য এআই খুব সূক্ষ্মভাবে পারদর্শী হবে।\n" +
                "\n" +
                "২. কোয়ান্টাম প্রযুক্তি\n" +
                "\n" +
                "বর্তমানে একটি সাইবার প্রতিযোগিতা চলছে, যেখানে কম্পিউটারের শক্তি বাড়ানো একটি গুরুত্বপূর্ণ কাজ। বর্তমানে এআই এবং মেশিন লার্নিং সবাই মিলে সাইবার হুমকির বিরুদ্ধে কাজ করছে। সমস্যা হলো, কোয়ান্টাম কম্পিউটিংয়ের অগ্রগতির সঙ্গে সঙ্গে নতুন একটি হুমকিও তৈরি হচ্ছে। এটি ডেভেলপ হলে আরএসএ এবং ইসিসি’র মতো এনক্রিপশনের স্ট্যান্ডার্ডগুলো আর কাজে আসবে না। ভবিষ্যতে ডাটা প্রাইভেসি এবং নিরাপত্তার জন্য কোয়ান্টাম-রেজিস্ট্যান্ট অ্যালগরিদম অত্যন্ত প্রয়োজনীয় হয়ে উঠবে। এ বছর আমেরিকার ন্যাশনাল ইনস্টিটিউট অফ স্ট্যান্ডার্ড অ্যান্ড টেকনোলজি পোস্ট-কোয়ান্টাম ক্রিপ্টোগ্রাফি অর্থাৎ এনক্রিপশন অ্যালগরিদম’র স্ট্যান্ডার্ড তৈরি করবে, যা কোয়ান্টাম আক্রমণকে প্রতিহত করতে পারবে। অর্থাৎ কোয়ান্টাম কম্পিউটারের কারণে বিশ্বব্যাপী সাইবার নিরাপত্তার একটি বড় বিবর্তন ঘটবে।\n" +
                "\n" +
                "৩. সেমিকন্ডাক্টর\n" +
                "\n" +
                "ডিজিটাল রূপান্তরের মূল হাতিয়ার হলো সেমিকন্ডাক্টর। মুর’র সূত্র অনুযায়ী প্রতি দুই বছরে মাইক্রোচিপের কম্পিউটিং ক্ষমতা দ্বিগুণ হয় আর দাম অর্ধেক হয়। তবে এই সূত্রের বাস্তবিক এবং আর্থিক সীমাবদ্ধতা আছে। বর্তমানে সেমিকন্ডাক্টর ইন্ডাস্ট্রি তার রূপান্তরের প্রায় প্রান্তে চলে এসেছে। এ বছর এর বিভিন্ন ফ্যাক্টর একটি সমতল অবস্থানে চলে আসবে। দুই ন্যানোমিটারের চিপ আসবে। ট্র্যানজিস্টরের আকৃতি হবে কয়েকটি অণুর সমান মাত্র। সব মিলিয়ে মুর’র সূত্রটিরও একটি বিবর্তন হয়ে যাবে। চিপগুলোর ক্ষুদ্র হওয়ার একটি চরম সীমায় চলে আসাতে ত্রিমাত্রিক চিপের জগৎ শুরু হতে পারে। পাশাপাশি ম্যাটেরিয়াল সায়েন্স এবং লিথোগ্রাফির নতুন ফর্ম কম্পিউটিং ক্ষমতাকে অনেক বাড়িয়ে দিতে পারে।\n" +
                "\n" +
                "৪. ব্যাটারি\n" +
                "\n" +
                "সরকারি এবং প্রাইভেট প্রতিষ্ঠান উভয়ের জন্যই ব্যাটারির সক্ষমতা বৃদ্ধি এবং মূল্য হ্রাস একটি গুরুত্বপূর্ণ বিষয়। বৈদ্যুতিক সচলতা এবং এনার্জি স্টোরেজের স্থায়িত্ব বাড়ানো বর্তমান সময়ের মূল উদ্দেশ্য। স্মার্ট গ্রিড এবং নবায়নযোগ্য জ্বালানির পক্ষে এটাকে সামাল দেওয়া বেশ কঠিন। এক্ষেত্রে লিথিয়াম ফেরো-ফসফেট বা এলএফপি এবং নিকেল ম্যাঙ্গানিজ কোবাল্ট বা এনএমসি যানবাহনের জন্য একটি আদর্শ সমাধান হয়ে উঠবে। ব্যাটারি রসায়নের অনেক প্রযুক্তিই আসবে এ বছর। যেমন, কোবাল্টমুক্ত (সোডিয়াম-আয়ন) অথবা সলিড-স্টেট ব্যাটারি ইত্যাদি। অর্থাৎ বৈদ্যুতিক যানবাহনের ক্ষেত্রে ব্যাটারির একটি বড় পরিবর্তন আসবে। কেননা, গাড়িতে অনেক উচ্চক্ষমতার ব্যাটারি লাগে। আর গতানুগতিক ব্যাটারির চেয়ে এর দামও কমে আসবে। ব্যাটারি তৈরিতে কিছু কিছু মৌলিক উপাদানের ওপর নির্ভরশীলতাও কমে আসবে এ বছর। যেমন, লিথিয়াম, নিকেল, কোবাল্ট, বিরল প্রাকৃতিক খনিজ এবং গ্রাফাইট। সেই সঙ্গে ব্যাটারিগুলো হবে নিরাপদ এবং দীর্ঘমেয়াদি।\n" +
                "\n" +
                "৫. মহাকাশ প্রযুক্তি\n" +
                "\n" +
                "এ বছর মানব জাতি চাঁদে ফিরে যাওয়ার প্রস্তুতি নেবে। মহাকাশের প্রতি আবারও তৈরি হওয়া এই আগ্রহ নতুন নতুন বৈজ্ঞানিক আবিষ্কারকে ত্বরান্বিত করবে এবং পৃথিবীর অনেক জটিল সমস্যাকেও সমাধান করবে। আবহাওয়া সংক্রান্ত বিপদ, টেলিকমিউনিকেশনের আরও অগ্রগতি, প্রতিরক্ষা এবং সার্বভৌমত্বের ক্ষেত্রেও পরিবর্তন আসবে। মহাকাশ ভ্রমণের কাজটি শুধু সরকার নয়, এবার প্রাইভেট প্রতিষ্ঠানও এতে অংশ নেবে। বড় বড় কিছু প্রযুক্তি যেমন ৫-জি, আধুনিক স্যাটেলাইট ব্যবস্থা, বড় আকারের ডাটা এবং কোয়ান্টাম কম্পিউটিং এক্ষেত্রে বেশ কাজে আসবে।\n" +
                "\n" +
                "এসব প্রযুক্তি ছাড়াও দীর্ঘমেয়াদি আরও কিছু প্রযুক্তি রয়েছে, যা আগামী পাঁচ বছরে পুরো পৃথিবীকে বদলে দিতে বিশেষ অবদান রাখবে। যেমন, লো-কার্বন হাইড্রোজেন। হাইড্রোজেন পরিবেশবান্ধব একটি জ্বালানি। কেননা, এটাকে উৎপাদন করতে শুধু পানিকে জ্বালালেই হয়। এরপরে রয়েছে কার্বন ক্যাপচার প্রযুক্তি। আগামীতে নতুন প্রযুক্তির মাধ্যমে ভারী শিল্প কারখানা থেকে কার্বন নিঃসরণ উল্লেখযোগ্য মাত্রায় কমিয়ে আনা হবে। এরপর আলোচনায় আসবে সিনথেটিক বায়োলজি। সাম্প্রতিক কোভিডের আক্রমণের পর থেকে এটি একটি গুরুত্বপূর্ণ বিষয় হয়ে উঠেছে। এর মাধ্যমে ভ্যাকসিনকে অনেক দ্রুতগতিতে উন্নত করা হবে। সিনথেটিক বায়োলজির মাধ্যমে বায়োলজি, ইঞ্জিনিয়ারিং, কম্পিউটার সায়েন্স এবং বায়োটেকনোলজিকে একত্রিত করা হবে, যা নাটকীয়ভাবে ওষুধ, কৃষি এবং পরিবেশের স্থায়িত্ব ইত্যাদি বিষয়কে অনেক অগ্রসর করবে।");
        arrayList.add(hashMap);
    }
}